spec/cassettes/StripeWrapper/_create/makes_a_card_declined_charge.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: UTF-8
      string: card[number]=4000000000000002&card[exp_month]=4&card[exp_year]=2018&card[cvc]=314
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/2.2.1
      Authorization:
      - Bearer sk_test_6BRNRq14487SJKowZrsKs2Gc
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"2.2.1","lang":"ruby","lang_version":"2.2.6 p396 (2016-11-15)","platform":"i386-mingw32","engine":"ruby","publisher":"stripe","uname":"Microsoft
        Windows [Version 10.0.14393]","hostname":"DESKTOP-T5V5TDV"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 11 Apr 2017 13:26:25 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '780'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_ASJeT6XXwxAfwb
      Stripe-Version:
      - '2017-04-06'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1A7P0nJbg6qtaO0vpzIEjUC1",
          "object": "token",
          "card": {
            "id": "card_1A7P0nJbg6qtaO0vPi3ocivO",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 4,
            "exp_year": 2018,
            "fingerprint": "cnG6iB5ewrN3lqfO",
            "funding": "credit",
            "last4": "0002",
            "metadata": {},
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "2.222.152.243",
          "created": 1491917185,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: 
  recorded_at: Tue, 11 Apr 2017 13:26:27 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: amount=999&card=tok_1A7P0nJbg6qtaO0vpzIEjUC1&currency=usd&description=a+valid+charge
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/2.2.1
      Authorization:
      - Bearer sk_test_6BRNRq14487SJKowZrsKs2Gc
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"2.2.1","lang":"ruby","lang_version":"2.2.6 p396 (2016-11-15)","platform":"i386-mingw32","engine":"ruby","publisher":"stripe","uname":"Microsoft
        Windows [Version 10.0.14393]","hostname":"DESKTOP-T5V5TDV"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Tue, 11 Apr 2017 13:26:27 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '201'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_ASJeXLz7IHzX2s
      Stripe-Version:
      - '2017-04-06'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "decline_code": "generic_decline",
            "charge": "ch_1A7P0oJbg6qtaO0vc2yw5Gwc"
          }
        }
    http_version: 
  recorded_at: Tue, 11 Apr 2017 13:26:29 GMT
recorded_with: VCR 3.0.3
